{"        ": 50280, "    ": 50284, "                          ": 50262, "                      ": 50266, "\t\t\t\t\t\t\t": 50289, "                        ": 50264, "         ": 50279, "       ": 50281, "\t\t\t\t\t\t\t\t\t": 50287, "  ": 50286, "\t\t\t": 50293, "                           ": 50261, "      ": 50282, "     ": 50283, "                   ": 50269, "               ": 50273, "                 ": 50271, "\t\t\t\t\t\t\t\t": 50288, "   ": 50285, "            ": 50276, "\t\t\t\t\t\t": 50290, "\t\t\t\t\t": 50291, "                         ": 50263, "          ": 50278, "                              ": 50258, "                  ": 50270, "                             ": 50259, "                ": 50272, "              ": 50274, "                     ": 50267, "                    ": 50268, "\t\t": 50294, "                               ": 50257, "           ": 50277, "\t\t\t\t": 50292, "                            ": 50260, "                       ": 50265, "             ": 50275}